#-------------------------------------------------------------------------------
# Name:        module1
# Purpose:
#
# Author:      a.butarev
#
# Created:     09.11.2018
# Copyright:   (c) a.butarev 2018
# Licence:     <your licence>
#-------------------------------------------------------------------------------
# game loto configuration

N = 90  # всего цифр (по кол-ву бочонков)
line = 3  # количество строк в карточке
n = 9  # количество клеток в строке
empty = 4  # количество пустых клеток в строке
char = '  '  # символ пустой клетки